posts/statement-of-faith.org
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+OPTIONS: toc:nil

#+HUGO_BASE_DIR: /home/shane/var/smulliga/source/git/pneumatology/pneumatology-hugo
#+HUGO_SECTION: ./post

#+TITLE: Statement of Faith
#+DATE: <2022-06-28>
#+AUTHOR: Shane Mulligan
#+KEYWORDS: faith christianity

** Summary
I am building up my statement of faith because
I want it to be true. I simply cannot blindly claim to believe in another's beliefs.

Explicit stances on certain issues covered
over time, as I myself learn.

[[https://mullikine.github.io/posts/jesus-is-the-risen-christ-who-died-for-my-sin/][Jesus is the risen Christ who died for my sin // Bodacious Blog]]

My testimony is True.
Jesus is at the cornerstone of our resurrection.
Jesus’ gospel is the cornerstone of my [[https://mullikine.github.io/posts/the-tapestry-of-truth/][own gospel]].

*** Church statement of faith and preaching
+ [[https://www.biblegateway.com/passage/?search=Galatians%202%3A2&version=NIV][Galatians 2:2]] :: 2 I went in response to a revelation and, meeting privately with those esteemed as leaders, I presented to them the gospel that I preach among the Gentiles. I wanted to be sure I was not running and had not been running my race in vain.

Firstly, I think it's important for a church
to have a statement of faith, otherwise it's
dishonest and stands for nothing.

Secondly, it should be allowable to preach
diverse opinions about contentious issues that
do not contradict the statement of faith.

Thirdly, I think a church should be very clear about if
a particular sermon falls within or outside
the church's statement of faith.

** Belief maps in progress
- [[https://github.com/mullikine/christianity][christianity]]
- [[http://github.com/mullikine/hamartiology-brain][hamartiology]]
- [[http://github.com/mullikine/prophets][prophets]]
- [[http://github.com/mullikine/apostles][apostles]]

