content/post/statement-of-faith.md
+++
title = "Statement of Faith"
author = ["Shane Mulligan"]
date = 2022-06-28T00:00:00+12:00
keywords = ["faith", "christianity"]
draft = false
+++

## Summary {#summary}

I am building up my statement of faith because
I want it to be true. I simply cannot blindly claim to believe in another's beliefs.

Explicit stances on certain issues covered
over time, as I myself learn.

[Jesus is the risen Christ who died for my sin // Bodacious Blog](https://mullikine.github.io/posts/jesus-is-the-risen-christ-who-died-for-my-sin/)

My testimony is True.
Jesus is at the cornerstone of our resurrection.
Jesus’ gospel is the cornerstone of my [own gospel](https://mullikine.github.io/posts/the-tapestry-of-truth/).


### Church statement of faith and preaching {#church-statement-of-faith-and-preaching}

[Galatians 2:2](https://www.biblegateway.com/passage/?search=Galatians%202%3A2&version=NIV)
: 2 I went in response to a revelation and, meeting privately with those esteemed as leaders, I presented to them the gospel that I preach among the Gentiles. I wanted to be sure I was not running and had not been running my race in vain.

Firstly, I think it's important for a church
to have a statement of faith, otherwise it's
dishonest and stands for nothing.

Secondly, it should be allowable to preach
diverse opinions about contentious issues that
do not contradict the statement of faith.

Thirdly, I think a church should be very clear about if
a particular sermon falls within or outside
the church's statement of faith.


## Belief maps in progress {#belief-maps-in-progress}

-   [christianity](https://github.com/mullikine/christianity)
-   [hamartiology](http://github.com/mullikine/hamartiology-brain)
-   [prophets](http://github.com/mullikine/prophets)
-   [apostles](http://github.com/mullikine/apostles)
