posts/statement-of-faith.org
** Doctrines
+ BCF 1689 :: [[http://www.grbc.net/wp-content/uploads/2015/09/The-1689-Baptist-Confession-of-Faith.pdf][The Second London Baptist Confession of Faith (1689)]]

| Name                                  | My approval                     | Notes / additions.                                                                                                                                                                                                                                                                                        |
|---------------------------------------+---------------------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [[https://mullikine.github.io/posts/gospel-of-jesus/][Gospel of Jesus]]                       | ✓ The cornerstone               | The cornerstone                                                                                                                                                                                                                                                                                           |
| [[https://en.wikipedia.org/wiki/Rhema_(doctrine)][Rhema]]                                 | ✓                               | [[https://mullikine.github.io/posts/the-tapestry-of-truth/][My own rhema]] (personal rhema from God)                                                                                                                                                                                                                                                                    |
| [[https://en.wikipedia.org/wiki/Nicene_Creed][Nicene Creed]]                          | ✓                               | [[https://mullikine.github.io/posts/astral-projection-pt-3/][Evidence]], Another dream [[https://mullikine.github.io/posts/spaceship-headed-for-mars/][Spaceship headed for Mars // Bodacious Blog]]                                                                                                                                                                                                                                       |
| [[https://en.wikipedia.org/wiki/Image_of_God#The_Apostle_Paul][Imago Dei according to Paul's concept]] | ✓                               | [[https://mullikine.github.io/posts/gospel-of-thomas/][Gospel of Thomas]], [[https://mullikine.github.io/posts/hierarchy-of-souls/][Hierarchy of Souls]], [[https://www.jw.org/en/bible-teachings/questions/jesus-son-of-god/][JW - Jesus Son of God]]                                                                                                                                                                                                                                               |
| [[https://en.wikipedia.org/wiki/Bipartite_(theology)][Bipartite {theology} - Wikipedia]]      | ✓                               | [[https://mullikine.github.io/posts/the-soul/][Spirit is separate. Soul is the material part of man, including body.]]  I'm working on my philosophy of soul.                                                                                                                                                                                              |
| [[https://en.wikipedia.org/wiki/Tripartite_(theology)][Tripartite {theology} - Wikipedia]]     | ✓                               | [[https://mullikine.github.io/posts/the-soul/][Spirit is separate. Soul is the mind and consciousness. Body is the reflection we see of ourselves in the mirror of the world, from our soul.]]                                                                                                                                                             |
| [[https://scholarsarchive.byu.edu/sba/vol1/iss1/6/][Mystical]] [[https://en.wikipedia.org/wiki/Bridal_theology][Bridal theology - Wikipedia]]  | ✓                               | [[https://mullikine.github.io/posts/astral-projection-pt-3/][Astral Projection Part 3 - The Images // Bodacious Blog]]. Yes, it has my approval, but I need to investigate further. [[https://blogs.ancientfaith.com/glory2godforallthings/2020/04/13/in-the-maw-of-the-bridal-chamber/][In the Maw of the Bridal Chamber]]                                                                                                                                                     |
| [[http://www.grbc.net/wp-content/uploads/2015/09/The-1689-Baptist-Confession-of-Faith.pdf][BCF 1689]]                              | ✓                               | Actively reviewing. I may make amendments in accordance with [[https://mullikine.github.io/posts/the-tapestry-of-truth/][Tapestry of Truth]]                                                                                                                                                                                                                            |
| Trinitarianism                        | Yes, but in accuracy and faith. | My actual beliefs: My Father is the God of Truth, the Holy Spirit God's spirit living within our bodies (the temple). The Holy Spirit is my Councilor and Comfortor, and Jesus is my Saviour. Described here: [[https://mullikine.github.io/posts/astral-projection-pt-2/][Astral Projection Part 2 - Sacred Kiss, Healing, Resurrection]] and here: [[https://mullikine.github.io/posts/prayer-of-salvation/][Prayer of Salvation]] |

** Bipartite vs tripartite
It's really just semantics and philosophical
theories, but spirit is distinctly different -
it's part of God if it is True.

** My string-theory of Christianity
- [[https://mullikine.github.io/posts/the-tapestry-of-truth/][The Tapestry of Truth]]

** Receiving grace
- [[https://mullikine.github.io/posts/revelation-of-sanctification/][Revelation of Sanctification {A work in progress}]]

** Trusted teachers
- [[https://www.youtube.com/c/DerekPrinceMinistries][Derek Prince]]

** Apostle Paul's stance on doctrine
Just because I have a doctrine, does not mean
it is your doctrine.

+ [[https://biblehub.com/kjv/romans/14.htm][Romans 14:22-23]] :: 22 Hast thou faith? have it to thyself before God. Happy is he that condemneth not himself in that thing which he alloweth. 23 And he that doubteth is damned if he eat, because he eateth not of faith: for whatsoever is not of faith is sin.

** Bridal Chamber
This is perhaps, a mystery which I saw, but
may happen to most Christians invisibly.

However, I have been a 'nominal Christian' my whole
life up until now but this moment defines my
true reception of the Holy Spirit.

I had even considered myself a Christian, but
although I resisted sin, I was not free from
it; Not until my bridal chamber experience.

