content/post/statement-of-faith.md


## Doctrines {#doctrines}

BCF 1689
: [The Second London Baptist Confession of Faith (1689)](http://www.grbc.net/wp-content/uploads/2015/09/The-1689-Baptist-Confession-of-Faith.pdf)

| Name                                                                                                                                        | My approval                     | Notes / additions.                                                                                                                                                                                                                                                                                                                                                                                                               |
|---------------------------------------------------------------------------------------------------------------------------------------------|---------------------------------|----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| [Gospel of Jesus](https://mullikine.github.io/posts/gospel-of-jesus/)                                                                       | ✓ The cornerstone               | The cornerstone                                                                                                                                                                                                                                                                                                                                                                                                                  |
| [Rhema](https://en.wikipedia.org/wiki/Rhema%5F(doctrine))                                                                                   | ✓                               | [My own rhema](https://mullikine.github.io/posts/the-tapestry-of-truth/) (personal rhema from God)                                                                                                                                                                                                                                                                                                                               |
| [Nicene Creed](https://en.wikipedia.org/wiki/Nicene%5FCreed)                                                                                | ✓                               | [Evidence](https://mullikine.github.io/posts/astral-projection-pt-3/), Another dream [Spaceship headed for Mars // Bodacious Blog](https://mullikine.github.io/posts/spaceship-headed-for-mars/)                                                                                                                                                                                                                                 |
| [Imago Dei according to Paul's concept](https://en.wikipedia.org/wiki/Image%5Fof%5FGod#The%5FApostle%5FPaul)                                | ✓                               | [Gospel of Thomas](https://mullikine.github.io/posts/gospel-of-thomas/), [Hierarchy of Souls](https://mullikine.github.io/posts/hierarchy-of-souls/), [JW - Jesus Son of God](https://www.jw.org/en/bible-teachings/questions/jesus-son-of-god/)                                                                                                                                                                                 |
| [Bipartite {theology} - Wikipedia](https://en.wikipedia.org/wiki/Bipartite%5F(theology))                                                    | ✓                               | [Spirit is separate. Soul is the material part of man, including body.](https://mullikine.github.io/posts/the-soul/)  I'm working on my philosophy of soul.                                                                                                                                                                                                                                                                      |
| [Tripartite {theology} - Wikipedia](https://en.wikipedia.org/wiki/Tripartite%5F(theology))                                                  | ✓                               | [Spirit is separate. Soul is the mind and consciousness. Body is the reflection we see of ourselves in the mirror of the world, from our soul.](https://mullikine.github.io/posts/the-soul/)                                                                                                                                                                                                                                     |
| [Mystical](https://scholarsarchive.byu.edu/sba/vol1/iss1/6/) [Bridal theology - Wikipedia](https://en.wikipedia.org/wiki/Bridal%5Ftheology) | ✓                               | [Astral Projection Part 3 - The Images // Bodacious Blog](https://mullikine.github.io/posts/astral-projection-pt-3/). Yes, it has my approval, but I need to investigate further. [In the Maw of the Bridal Chamber](https://blogs.ancientfaith.com/glory2godforallthings/2020/04/13/in-the-maw-of-the-bridal-chamber/)                                                                                                          |
| [BCF 1689](http://www.grbc.net/wp-content/uploads/2015/09/The-1689-Baptist-Confession-of-Faith.pdf)                                         | ✓                               | Actively reviewing. I may make amendments in accordance with [Tapestry of Truth](https://mullikine.github.io/posts/the-tapestry-of-truth/)                                                                                                                                                                                                                                                                                       |
| Trinitarianism                                                                                                                              | Yes, but in accuracy and faith. | My actual beliefs: My Father is the God of Truth, the Holy Spirit God's spirit living within our bodies (the temple). The Holy Spirit is my Councilor and Comfortor, and Jesus is my Saviour. Described here: [Astral Projection Part 2 - Sacred Kiss, Healing, Resurrection](https://mullikine.github.io/posts/astral-projection-pt-2/) and here: [Prayer of Salvation](https://mullikine.github.io/posts/prayer-of-salvation/) |


## Bipartite vs tripartite {#bipartite-vs-tripartite}

It's really just semantics and philosophical
theories, but spirit is distinctly different -
it's part of God if it is True.


## My string-theory of Christianity {#my-string-theory-of-christianity}

-   [The Tapestry of Truth](https://mullikine.github.io/posts/the-tapestry-of-truth/)


## Receiving grace {#receiving-grace}

-   [Revelation of Sanctification {A work in progress}](https://mullikine.github.io/posts/revelation-of-sanctification/)


## Trusted teachers {#trusted-teachers}

-   [Derek Prince](https://www.youtube.com/c/DerekPrinceMinistries)


## Apostle Paul's stance on doctrine {#apostle-paul-s-stance-on-doctrine}

Just because I have a doctrine, does not mean
it is your doctrine.

[Romans 14:22-23](https://biblehub.com/kjv/romans/14.htm)
: 22 Hast thou faith? have it to thyself before God. Happy is he that condemneth not himself in that thing which he alloweth. 23 And he that doubteth is damned if he eat, because he eateth not of faith: for whatsoever is not of faith is sin.


## Bridal Chamber {#bridal-chamber}

This is perhaps, a mystery which I saw, but
may happen to most Christians invisibly.

However, I have been a 'nominal Christian' my whole
life up until now but this moment defines my
true reception of the Holy Spirit.

I had even considered myself a Christian, but
although I resisted sin, I was not free from
it; Not until my bridal chamber experience.
