content/post/statement-of-faith.md


### The so-called 'Sacred Kiss' {#the-so-called-sacred-kiss}

Indeed, I believe the ['sacred kiss' happened to me](https://mullikine.github.io/posts/astral-projection-pt-2/).

I believe it's the Holy Spirit making contact,
and the union.

{{< highlight text "linenos=table, linenostart=1" >}}
So I tilted my head to the left, away from the
direction of their presence, which was right
next to me on the other side, and I had a
feeling that the person would look closely at
me (i.e. my spirit).

I felt like I had just undergone a diagnostic.
I did not feel frightened. Just the happy
feeling of being in good hands (like a doctor)
and on the verge of waking up. And saw some
grey tessellation patterns as I’m opening my
eyes again.
{{< /highlight >}}


### Gospel of Philip {#gospel-of-philip}

The Gospel of Philip, a Valentinian tractate
found in the Nag Hammadi library, has sparked
the interest of some Latter-day Saints because
of its numerous references to a bridal chamber
associated with the holy of holies in the
temple (Gospel of Philip 69.14-70.4), such as
to a "mirrored bridal chamber" (Gospel of
Philip 65.12) and a sacred kiss (Gospel of
Philip 59.1-5).

The purpose of this paper is to examine the
bridal chamber references within their
Valentinian context.

While there may be some interesting parallels
with LDS teachings about eternal marriage, it
is imporant to understand that the
Valentinians understood these references in
substantially different ways.


## Contentious issues {#contentious-issues}

While I make statements on these, I have only
what I truly believe to go by, if I am honest,
so I will only write what I believe.

However, it appears that my stance on this is
in line with Valentinianism, which is
encouraging to me, so I no longer feel bad
about believing it.

Therefore, by my saying that these are my True
beliefs, I have confidence, since I think I am
this type of Christian, to my current
knowledge.

I am working on a theory of hamartiology,
which will explain how it can be sin for onea
person and not another.


### Spiritual Marriage must come First! {#spiritual-marriage-must-come-first}

`Be spiritually married to Christ first, seriously!`

No kidding!

[Gospel of Philip](https://mullikine.github.io/posts/gospel-of-philip/)
: A bridal chamber is not for the animals, nor is it for the slaves, nor for defiled women; but it is for free men and virgins.

To be united with
Christ / a Holy Angel of the Saviour you need to be either:

-   A free man
-   A virgin woman

But the [Gospel of Thomas](https://mullikine.github.io/posts/gospel-of-thomas/), teaches that a woman can spiritually become a 'free man'.

[Thomas 114](https://mullikine.github.io/posts/gospel-of-thomas/)
: (114) Simon Peter said to them: Let Mariham go out from among us, for women are not worthy of the life. Jesus said: Look, I will lead her that I may make her male, in order that she too may become a living spirit resembling you males. For every woman who makes herself male will enter into the kingdom of heaven.


### Christian Marriage {#christian-marriage}

It's for remaining faithful to the Lord God until death.
See [The Tapestry of Truth](https://mullikine.github.io/posts/the-tapestry-of-truth/).

| Name                        | Approval and Conditions                                                                                                                                                                                        | Notes                                                                           |
|-----------------------------|----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|---------------------------------------------------------------------------------|
| Straight Christian Marriage | I approve under the condition that each is a [born-again believer](https://mullikine.github.io/posts/the-tapestry-of-truth/) and doing it out of agape love/truth.                                             |                                                                                 |
| Gay Christian Marriage      | I approve under the condition that each is a [born-again believer](https://mullikine.github.io/posts/the-tapestry-of-truth/) and doing it out of agape love/truth.                                             | [Confirmed](https://mullikine.github.io/posts/dream-discernment-of-judgement/). |
| LGBTQ+ Christian Marriage   | I approve under the condition that each is a [born-again believer](https://mullikine.github.io/posts/the-tapestry-of-truth/) and doing it out of agape love/truth (and like with like; See Gospel of Philip.). | [Confirmed](https://mullikine.github.io/posts/dream-discernment-of-judgement/). |

In other words, the reality is that under the hood, Truthfulness and Faithfulness are what matters.
And the truth of the utility of the earthly marriage is that it is dutiful to God for the intention of preserving a faithful relationship with God.

Please see why spiritual identity (including [sexual identity](https://mullikine.github.io/posts/the-stupidity-of-stigmatization/)) is sacred.

It's about matching likeness, even across the continuum of sexual identities.

See [Gospel of Philip](https://mullikine.github.io/posts/gospel-of-philip/):

{{< highlight text "linenos=table, linenostart=1" >}}
Indeed, every act of sexual intercourse which
has occurred between those unlike one another
is adultery.

God is a dyer.

As the good dyes, which are called "true",
dissolve with the things dyed in them, so it
is with those whom God has dyed.

Since his dyes are immortal, they become
immortal by means of his colors.
{{< /highlight >}}


### Suicides {#suicides}

| Name                      | Approval and Conditions                                                                                                                                                                                          | Notes                                                                                      |
|---------------------------|------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|--------------------------------------------------------------------------------------------|
| Do suicides go to Heaven? | With my limited understanding it might possible. I believe Jesus properly died and He traversed everywhere we can go in this life, including into death, and he is the rope/ladder/way so it's a very long rope. | This takes a lot of empathy to reason about, and then it's only reason and not experience. |


## I made a start on this document 2 weeks ago <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-06-07 Tue&gt;</span></span> {#i-made-a-start-on-this-document-2-weeks-ago}

If a person said to you, "Drop what you're
doing and follow me." What would doing so look
like?

The thing you drop will be different.
Likewise, the way you follow is also different.

If I were to ask you to interpret an artwork,
and I saw you asking someone else for their
interpretation before coming up with your own,
I would be disappointed in you.

I want to come up with my own interpretation
of the gospel, which I understand myself on and in my own terms.
I think everyone should do this. That is true seeking.

`Matthew 15:13-14`
: Leave them; they are blind guides. If a blind man leads a blind man, both will fall into a pit.
