posts/statement-of-faith.org
** This has been a rhema to me personally
I believe this has been the Word of God
speaking to me =individually=.

#+BEGIN_SRC text -n :async :results verbatim code
  rhema
      A process within Christian epistemology.

      In this understanding, the logos is
      universal for all humanity, while any
      intellectual changes for a specific
      individual believer are categorized as
      rhema.

      Under this system, "rhema" is a broad term
      that includes many types of spiritual
      interaction; "any method God uses to
      reveal His specific will to an individual,
      whether by divinely directed desire,
      illumination, revelation, vision, or
      dream.

      ...rhema will be our general term to refer
      to all of these means of God communicating
      His specific will to an individual." Hamon
      states "A rhema is an inspired Word
      birthed within your own spirit, a whisper
      from the Holy Spirit like the still, small
      voice that spoke to Elijah in the cave.

      It is a divinely inspired impression upon
      your soul, a flash of thought or a
      creative idea from God.

      It is conceived in your spirit, but
      birthed into your natural understanding by
      divine illumination.

      A true rhema carries with it a deep inner
      assurance and witness of the Spirit."

      Our general term to refer to all of these
      means of God communicating His specific
      will to an individual." Hamon states "A
      rhema is an inspired Word birthed within
      your own spirit, a whisper from the Holy
      Spirit like the still, small voice that
      spoke to Elijah in the cave.

      https://en.wikipedia.org/wiki/Rhema_(doctrine)
#+END_SRC